

LANGUAGES = {
    'ru': {
        'lang': 'Русский',
        'currency': 'сум',
        'sum': 'Cумма',
        'start_welcome': 'Добро пожаловать в бот доставки пиццы\n\nОтправьте свой номер телефона в формате: +998 ** *** ** **',
        'ask_phone_mistake': ' Не верный формат номера\nОтправьте свой номер телефона в формате: +998 ** *** ** **',
        'sent_your_phone': 'Ваш номер',
        'send_code': 'Вам отправили код. Введите код в формате',
        'send_code_again': 'Вам отправили новый код. Введите код в формате',
        'send_code_cooldown': 'Попробуйте через',
        'send_code_limit': 'Вы превысели лимит. Попробуйте завтра.',
        'send_code_limit_attempts': 'Вы израсходовали все попытки. Сгенерируйте новый код.',
        'send_code_mistake': 'Код не совпал',
        'changed_phone': 'Номер телефона изменен',

        'main_menu_welcome': 'Добро пожаловать!\n\nЧто будете заказывать?',

        'main_menu': '🏠 Главное меню',
        'back_btn': '⬅️ Назад',
        'cart_btn': '📥 Корзина',
        'cart_add_btn': '📥 Добавить в карзину',
        'cart_clear': '🔄 Очистить',
        'make_order': '🚖 Оформить заказ',
        'delete_from_cart': '✖ Удалить из корзины',
        'save_product': '✅ Сохранить',
        'type_pickup': '🏃 Самовывоз',
        'type_delivery': '🚖 Доставка',
        'standard_comment': '⏩ Пропустить',
        'payment_method_cash': '💵 Наличные',
        'payment_method_terminal': '📠 Терминал',
        'get_location': '📍 Отправить местоположение',
        'confirm': '✅ Заказываю',
        'cancel': '❌ Отменить',

        'deleted_from_cart': 'удален из корзины',
        'your_cart': 'Ваша корзина',
        'total': 'Итого',
        'cart_empty': 'Ваша корзина пуста',
        'cart_cleaned': 'Ваша корзина очищена.',
        'choose_delivery_type': 'Заберите свой заказ <b>самостоятельно</b> или <b>выберите доставку</b> 👇🏻',
        'choose_address': '<b>Куда нужно доставить?</b>\nОтправьте местоположение нажав на кнопку ниже или отправьте нажав на 📎',
        'out_of_location': 'Данная локация временно не обслуживается нашей доставкой.',
        'time_order': '<b>Когда хотите получить заказ?</b>\nУкажите удобное для Вас время получения заказа 👇🏻',
        'time_order_answer': 'В ближайшее время',
        'ask_comment': '<b>Оставьте комментарий к самовывозу</b>\nУкажите день и приблизительное время, когда вы сможете забрать товар, а также имя человека, на которого нужно отложить покупку 👇🏻',
        'text_limit': 'Текст не может содержать больше 50 символов',
        'payment_method': 'Выберите удобный для Вас <b>метод оплаты</b> 👇🏻',
        'final': 'Отлично! Теперь давайте проверим заказ 👇🏻',

        'finish_order1': 'Спасибо, ваш заказ ',
        'finish_order2': ' передан на обработку.\nОжидайте подтверждения заказа от бота!',



        'generate_main_menu_menu': '🍴 Меню',

        'generate_main_menu_contacts': '☎️ Контакты',
        'contacts_info': '''Телефон: +998902282020
Звонок бесплатный''',


        'generate_main_menu_reviews': '✍️ Оставить отзыв',
        'reviews_info': '''✅ Контроль сервиса доставки ZALUPA
Мы благодарим за сделанный выбор и будем рады, если Вы поможете улучшить качество нашего сервиса!
Оцените нашу работу по 5 бальной шкале.''',
        'review_five': '😊Все понравилось, на 5 ❤️',
        'review_five_info': '''Мы рады, что Вы остались довольны 😊. Будем продолжать стараться радовать Вас и Ваших близких 🤗

Ваш DodoPizza ❤️''',
        'review_four': '☺️Нормально, на 4 ⭐️⭐️⭐️⭐️',
        'review_four_info': 'Мы рады, что Вам понравилось 😊. Что ещё мы можем сделать, чтобы улучшить наш сервис?',
        'review_three': '😐 Удовлетворительно на 3 ⭐️⭐️⭐️',
        'review_three_info': 'Нам жаль, что Вас не удовлетворил наш сервис 😔. Помогите нам стать лучше, оставьте свои замечания и предложения 👇🏻. Будем работать над улучшением сервиса 🙏🏻',
        'review_two': '☹️Не понравилось, на 2 ⭐️⭐️',
        'review_two_info': 'Нам жаль, что Вас не удовлетворил наш сервис 😔. Помогите нам стать лучше, оставьте свои замечания и предложения 👇🏻. Будем работать над улучшением сервиса 🙏🏻',
        'review_one': '😤Хочу пожаловаться👎🏻',
        'review_one_info': 'Нам жаль, что Вас не удовлетворил наш сервис 😔. Помогите нам стать лучше, оставьте свои замечания и предложения 👇🏻. Будем работать над улучшением сервиса 🙏🏻',
        'review_sent': 'Спасибо за ваш отзыв!',

        'generate_main_menu_delivery': '🚀 О доставке',
        'delivery_info': '''Если не успеем доставить заказ в течении 60 минут, мы
отправим Вам в подарок промокод на большую пиццу.
    
Доставка бесплатная. Сумма заказа от 45.000 сум.''',

        'generate_main_menu_settings': '⚙️ Настройки',
        'settings_change_language': '🌐 Выбрать язык',
        'settings_ask_language': 'Пожалуйста, выберите язык ⬇️',
        'settings_change_phone': '📱 Сменить номер',
        'settings_ask_phone': 'Введите номер телефона или отправьте нажав кнопку ниже ⬇️',
        'settings_send_phone': '📱 Отправить номер',
        'settings_send_phone_code': '🔄 Получить новый код',






        'menu': '🍴 Меню',
        'menu_choose_categories': 'Выберите раздел 👇🏻',
        'menu_choose_products': 'Выберите продукцию  👇',
        'menu_chose_product': 'Отличный выбор, закажем что-нибудь еще?',
        'menu_pizza': '🍕 Пицца',
        'menu_combo': '🔥 Комбо',
        'menu_snacks': '🌯 Закуски',
        'menu_desserts': '🍰 Десерты',
        'menu_drinks': '🥤 Напитки',
        'menu_sauces': '🥫 Соусы',

        'product_size_little': 'Маленькая',
        'product_size_medium': 'Средняя',
        'product_size_large': 'Большая',
        'product_type_default': 'Традиционное',
        'product_type_thin': 'Тонкое',
        'product_price': 'Цена',
        'product_quantity_min': 'Нельзя купить меньше 1 товара',
        'product_quantity_max': 'Нельзя купить более 10 товаров одного наименования',

        'final_type': 'Тип',
        'final_address': 'Адрес',
        'final_phone_number': 'Номер телефона',
        'final_payment_method': 'Метод оплаты',
        'final_time_order': 'Время получения заказа',
        'final_comment': 'Комментарий',
        'final_pickup_from': 'Самовывоз из',
    },
    'en': {
        'lang': 'English',
        'settings_change_phone': '📱 Change number',
        'main_menu_welcome': 'DQWWWWWDQWDWQD',
    }
}

products_translate = {
    'ru': {
        1: ['Пепперони', 'Пепперони с говядиной, сыр моцарелла из цельного молока, томатный соус'],
        2: ['Кола', 'какаята уйна']
    },
    'en': {
        1: ['Pepperoni', 'sukablyat']
    }
}



def check_language(lang, text):
    try:
        lang_key = LANGUAGES[lang][f'{text}']
    except:
        lang_key = LANGUAGES[list(LANGUAGES.keys())[0]][f'{text}']
    return lang_key


def check_products_translate(lang, id, description=False):
    if description:
        try:
            lang_key = products_translate[lang][id][1]
        except:
            lang_key = products_translate[list(products_translate.keys())[0]][id][1]
        return lang_key

    else:
        try:
            lang_key = products_translate[lang][id][0]
        except:
            lang_key = products_translate[list(products_translate.keys())[0]][id][0]
        return lang_key

def make_product_title(lang, product_info):
    product_info = [int(i) for i in product_info.split('_')]
    if len(product_info) > 1:
        if product_info[1] == 0:
            product_size = check_language(lang, 'product_size_little')
        elif product_info[1] == 1:
            product_size = check_language(lang, 'product_size_medium')
        else:
            product_size = check_language(lang, 'product_size_large')

        if product_info[2] == 0:
            product_type = check_language(lang, 'product_type_default')
        else:
            product_type = check_language(lang, 'product_type_thin')

        product_title = f'{check_products_translate(lang, product_info[0])}, {product_size}, {product_type}'
    else:
        product_title = f'{check_products_translate(lang, product_info[0])}'

    return product_title



